{"userDefinedMetadata": {"signature": {"outputs": {"conv2d_9/Sigmoid": {"name": "conv2d_9/Sigmoid"}}}}, "generatedBy": "1.15.0", "format": "graph-model", "weightsManifest": [{"weights": [{"name": "conv2d_1/kernel", "quantization": {"min": -0.10905514195853588, "scale": 0.0009401305341253094, "dtype": "uint8"}, "dtype": "float32", "shape": [9, 9, 1, 64]}, {"name": "conv2d_7/bias", "quantization": {"min": -6.082806497693573e-05, "scale": 5.738496695937333e-07, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "conv2d_1/bias", "quantization": {"min": -0.0011609911430152315, "scale": 7.490265438807945e-06, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_8/batchnorm/mul", "quantization": {"min": 0.3409666121006012, "scale": 0.004641976894116869, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_1/batchnorm/mul", "quantization": {"min": 6.1368255615234375, "scale": 0.047753704295438876, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_1/batchnorm/sub", "quantization": {"min": -4.652439801833209, "scale": 0.038449915717629825, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "conv2d_2/kernel", "quantization": {"min": -0.1861799025068096, "scale": 0.001421220629822974, "dtype": "uint8"}, "dtype": "float32", "shape": [3, 3, 64, 64]}, {"name": "conv2d_2/bias", "quantization": {"min": -7.78494397344926e-05, "scale": 6.433837994586165e-07, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_8/batchnorm/sub", "quantization": {"min": -0.8900906805898628, "scale": 0.011126133507373286, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_2/batchnorm/mul", "quantization": {"min": 0.83802330493927, "scale": 0.0048350600635304174, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_2/batchnorm/sub", "quantization": {"min": -1.1990341102375703, "scale": 0.009294838063857135, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "conv2d_3/kernel", "quantization": {"min": -0.14562331928926356, "scale": 0.0012135276607438629, "dtype": "uint8"}, "dtype": "float32", "shape": [3, 3, 64, 64]}, {"name": "conv2d_3/bias", "quantization": {"min": -7.89618763305685e-05, "scale": 5.264125088704567e-07, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_7/batchnorm/mul", "quantization": {"min": 0.5105237364768982, "scale": 0.003520047197154924, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_7/batchnorm/sub", "quantization": {"min": -0.2860203613253201, "scale": 0.008172010323580574, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_3/batchnorm/mul", "quantization": {"min": 0.5034236907958984, "scale": 0.0047020229638791555, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_3/batchnorm/sub", "quantization": {"min": -1.1353800553901523, "scale": 0.012757079274046654, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "conv2d_4/kernel", "quantization": {"min": -0.1534593864398844, "scale": 0.0012682593920651604, "dtype": "uint8"}, "dtype": "float32", "shape": [3, 3, 64, 64]}, {"name": "conv2d_4/bias", "quantization": {"min": -5.3460423334720814e-05, "scale": 3.383571097134229e-07, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "conv2d_8/kernel", "quantization": {"min": -0.2070706957695531, "scale": 0.0014897172357521806, "dtype": "uint8"}, "dtype": "float32", "shape": [3, 3, 64, 64]}, {"name": "conv2d_8/bias", "quantization": {"min": -0.00014974754303693772, "scale": 1.101084875271601e-06, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_4/batchnorm/mul", "quantization": {"min": 0.6513462662696838, "scale": 0.0035802268514446185, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_4/batchnorm/sub", "quantization": {"min": -1.3569372261271757, "scale": 0.011499468018026912, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "conv2d_5/kernel", "quantization": {"min": -0.15648604000315947, "scale": 0.0012225471875246833, "dtype": "uint8"}, "dtype": "float32", "shape": [3, 3, 64, 64]}, {"name": "conv2d_9/kernel", "quantization": {"min": -0.09941323779377281, "scale": 0.001117002671840144, "dtype": "uint8"}, "dtype": "float32", "shape": [3, 3, 64, 1]}, {"name": "conv2d_5/bias", "quantization": {"min": -4.501129596439355e-05, "scale": 4.3280092273455334e-07, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_5/batchnorm/mul", "quantization": {"min": 0.5302922129631042, "scale": 0.0044567521880654725, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_5/batchnorm/sub", "quantization": {"min": -1.3074871582143446, "scale": 0.012219506151535931, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "conv2d_6/kernel", "quantization": {"min": -0.1548757014321346, "scale": 0.0011557888166577209, "dtype": "uint8"}, "dtype": "float32", "shape": [3, 3, 64, 64]}, {"name": "conv2d_6/bias", "quantization": {"min": -5.3327913166653804e-05, "scale": 4.98391711837886e-07, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "conv2d_9/bias", "quantization": {"min": 0.027627266943454742, "scale": 1.0, "dtype": "uint8"}, "dtype": "float32", "shape": [1]}, {"name": "batch_normalization_6/batchnorm/mul", "quantization": {"min": 0.5242953300476074, "scale": 0.004194965082056382, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_6/batchnorm/sub", "quantization": {"min": -1.074145934161018, "scale": 0.012206203797284295, "dtype": "uint8"}, "dtype": "float32", "shape": [64]}, {"name": "conv2d_7/kernel", "quantization": {"min": -0.17091444333394368, "scale": 0.0012567238480437036, "dtype": "uint8"}, "dtype": "float32", "shape": [3, 3, 64, 64]}], "paths": ["group1-shard1of1.bin"]}], "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"versions": {}, "node": [{"name": "input_1", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}, "op": "Placeholder"}, {"name": "conv2d_1/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "1"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_7/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_1/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_8/batchnorm/mul", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_1/batchnorm/mul", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_1/batchnorm/sub", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_2/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_2/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_8/batchnorm/sub", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_2/batchnorm/mul", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_2/batchnorm/sub", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_3/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_3/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_7/batchnorm/mul", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_7/batchnorm/sub", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_3/batchnorm/mul", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_3/batchnorm/sub", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_4/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_4/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_8/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_8/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_4/batchnorm/mul", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_4/batchnorm/sub", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_5/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_9/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_5/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_5/batchnorm/mul", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_5/batchnorm/sub", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_6/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_6/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_9/bias", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_6/batchnorm/mul", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "batch_normalization_6/batchnorm/sub", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_7/kernel", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}, "op": "Const"}, {"name": "conv2d_1/BiasAdd", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}, "input": ["input_1", "conv2d_1/kernel", "conv2d_1/bias"], "op": "_FusedConv2D", "device": "/device:CPU:0"}, {"name": "batch_normalization_1/batchnorm/mul_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_1/batchnorm/mul", "conv2d_1/BiasAdd"], "op": "Mul"}, {"name": "batch_normalization_1/batchnorm/add_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_1/batchnorm/mul_1", "batch_normalization_1/batchnorm/sub"], "op": "Add"}, {"name": "activation_1/Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_1/batchnorm/add_1"], "op": "Relu"}, {"name": "conv2d_2/BiasAdd", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}, "input": ["activation_1/Relu", "conv2d_2/kernel", "conv2d_2/bias"], "op": "_FusedConv2D", "device": "/device:CPU:0"}, {"name": "batch_normalization_2/batchnorm/mul_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_2/batchnorm/mul", "conv2d_2/BiasAdd"], "op": "Mul"}, {"name": "batch_normalization_2/batchnorm/add_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_2/batchnorm/mul_1", "batch_normalization_2/batchnorm/sub"], "op": "Add"}, {"name": "activation_2/Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_2/batchnorm/add_1"], "op": "Relu"}, {"name": "conv2d_3/BiasAdd", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}, "input": ["activation_2/Relu", "conv2d_3/kernel", "conv2d_3/bias"], "op": "_FusedConv2D", "device": "/device:CPU:0"}, {"name": "batch_normalization_3/batchnorm/mul_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_3/batchnorm/mul", "conv2d_3/BiasAdd"], "op": "Mul"}, {"name": "batch_normalization_3/batchnorm/add_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_3/batchnorm/mul_1", "batch_normalization_3/batchnorm/sub"], "op": "Add"}, {"name": "activation_3/Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_3/batchnorm/add_1"], "op": "Relu"}, {"name": "conv2d_4/BiasAdd", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}, "input": ["activation_3/Relu", "conv2d_4/kernel", "conv2d_4/bias"], "op": "_FusedConv2D", "device": "/device:CPU:0"}, {"name": "batch_normalization_4/batchnorm/mul_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_4/batchnorm/mul", "conv2d_4/BiasAdd"], "op": "Mul"}, {"name": "batch_normalization_4/batchnorm/add_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_4/batchnorm/mul_1", "batch_normalization_4/batchnorm/sub"], "op": "Add"}, {"name": "activation_4/Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_4/batchnorm/add_1"], "op": "Relu"}, {"name": "conv2d_5/BiasAdd", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}, "input": ["activation_4/Relu", "conv2d_5/kernel", "conv2d_5/bias"], "op": "_FusedConv2D", "device": "/device:CPU:0"}, {"name": "batch_normalization_5/batchnorm/mul_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_5/batchnorm/mul", "conv2d_5/BiasAdd"], "op": "Mul"}, {"name": "batch_normalization_5/batchnorm/add_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_5/batchnorm/mul_1", "batch_normalization_5/batchnorm/sub"], "op": "Add"}, {"name": "activation_5/Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_5/batchnorm/add_1"], "op": "Relu"}, {"name": "conv2d_6/BiasAdd", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}, "input": ["activation_5/Relu", "conv2d_6/kernel", "conv2d_6/bias"], "op": "_FusedConv2D", "device": "/device:CPU:0"}, {"name": "batch_normalization_6/batchnorm/mul_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_6/batchnorm/mul", "conv2d_6/BiasAdd"], "op": "Mul"}, {"name": "batch_normalization_6/batchnorm/add_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_6/batchnorm/mul_1", "batch_normalization_6/batchnorm/sub"], "op": "Add"}, {"name": "activation_6/Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_6/batchnorm/add_1"], "op": "Relu"}, {"name": "conv2d_7/BiasAdd", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}, "input": ["activation_6/Relu", "conv2d_7/kernel", "conv2d_7/bias"], "op": "_FusedConv2D", "device": "/device:CPU:0"}, {"name": "batch_normalization_7/batchnorm/mul_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_7/batchnorm/mul", "conv2d_7/BiasAdd"], "op": "Mul"}, {"name": "batch_normalization_7/batchnorm/add_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_7/batchnorm/mul_1", "batch_normalization_7/batchnorm/sub"], "op": "Add"}, {"name": "activation_7/Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_7/batchnorm/add_1"], "op": "Relu"}, {"name": "conv2d_8/BiasAdd", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}, "input": ["activation_7/Relu", "conv2d_8/kernel", "conv2d_8/bias"], "op": "_FusedConv2D", "device": "/device:CPU:0"}, {"name": "batch_normalization_8/batchnorm/mul_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_8/batchnorm/mul", "conv2d_8/BiasAdd"], "op": "Mul"}, {"name": "batch_normalization_8/batchnorm/add_1", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_8/batchnorm/mul_1", "batch_normalization_8/batchnorm/sub"], "op": "Add"}, {"name": "activation_8/Relu", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["batch_normalization_8/batchnorm/add_1"], "op": "Relu"}, {"name": "conv2d_9/BiasAdd", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}}, "input": ["activation_8/Relu", "conv2d_9/kernel", "conv2d_9/bias"], "op": "_FusedConv2D", "device": "/device:CPU:0"}, {"name": "conv2d_9/Sigmoid", "attr": {"T": {"type": "DT_FLOAT"}}, "input": ["conv2d_9/BiasAdd"], "op": "Sigmoid"}]}}