{"modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "1"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/bias", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/bias", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/bias", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/bias", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4/bias", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/kernel", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/bias", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5/kernel", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_9/kernel", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5/bias", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/kernel", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/bias", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_9/bias", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/kernel", "op": "Const", "attr": {"value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/BiasAdd", "op": "_FusedConv2D", "input": ["input_1", "conv2d_1/kernel", "conv2d_1/bias"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "device": "/device:CPU:0"}, {"name": "batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_1/batchnorm/mul", "conv2d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_1/batchnorm/mul_1", "batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_1/Relu", "op": "Relu", "input": ["batch_normalization_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/BiasAdd", "op": "_FusedConv2D", "input": ["activation_1/Relu", "conv2d_2/kernel", "conv2d_2/bias"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "device": "/device:CPU:0"}, {"name": "batch_normalization_2/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_2/batchnorm/mul", "conv2d_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_2/batchnorm/mul_1", "batch_normalization_2/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_2/Relu", "op": "Relu", "input": ["batch_normalization_2/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/BiasAdd", "op": "_FusedConv2D", "input": ["activation_2/Relu", "conv2d_3/kernel", "conv2d_3/bias"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "device": "/device:CPU:0"}, {"name": "batch_normalization_3/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_3/batchnorm/mul", "conv2d_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_3/batchnorm/mul_1", "batch_normalization_3/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_3/Relu", "op": "Relu", "input": ["batch_normalization_3/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4/BiasAdd", "op": "_FusedConv2D", "input": ["activation_3/Relu", "conv2d_4/kernel", "conv2d_4/bias"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "device": "/device:CPU:0"}, {"name": "batch_normalization_4/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_4/batchnorm/mul", "conv2d_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_4/batchnorm/mul_1", "batch_normalization_4/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_4/Relu", "op": "Relu", "input": ["batch_normalization_4/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5/BiasAdd", "op": "_FusedConv2D", "input": ["activation_4/Relu", "conv2d_5/kernel", "conv2d_5/bias"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "device": "/device:CPU:0"}, {"name": "batch_normalization_5/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_5/batchnorm/mul", "conv2d_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_5/batchnorm/mul_1", "batch_normalization_5/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_5/Relu", "op": "Relu", "input": ["batch_normalization_5/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/BiasAdd", "op": "_FusedConv2D", "input": ["activation_5/Relu", "conv2d_6/kernel", "conv2d_6/bias"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "device": "/device:CPU:0"}, {"name": "batch_normalization_6/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_6/batchnorm/mul", "conv2d_6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_6/batchnorm/mul_1", "batch_normalization_6/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_6/Relu", "op": "Relu", "input": ["batch_normalization_6/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/BiasAdd", "op": "_FusedConv2D", "input": ["activation_6/Relu", "conv2d_7/kernel", "conv2d_7/bias"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "device": "/device:CPU:0"}, {"name": "batch_normalization_7/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_7/batchnorm/mul", "conv2d_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_7/batchnorm/mul_1", "batch_normalization_7/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_7/Relu", "op": "Relu", "input": ["batch_normalization_7/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/BiasAdd", "op": "_FusedConv2D", "input": ["activation_7/Relu", "conv2d_8/kernel", "conv2d_8/bias"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "device": "/device:CPU:0"}, {"name": "batch_normalization_8/batchnorm/mul_1", "op": "Mul", "input": ["batch_normalization_8/batchnorm/mul", "conv2d_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/batchnorm/add_1", "op": "Add", "input": ["batch_normalization_8/batchnorm/mul_1", "batch_normalization_8/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_8/Relu", "op": "Relu", "input": ["batch_normalization_8/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_9/BiasAdd", "op": "_FusedConv2D", "input": ["activation_8/Relu", "conv2d_9/kernel", "conv2d_9/bias"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}}, "device": "/device:CPU:0"}, {"name": "conv2d_9/Sigmoid", "op": "Sigmoid", "input": ["conv2d_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {}}, "convertedBy": "TensorFlow.js Converter v1.4.0", "format": "graph-model", "generatedBy": "1.15.0", "weightsManifest": [{"weights": [{"name": "conv2d_1/kernel", "shape": [9, 9, 1, 64], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_3/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_4/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_4/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_5/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_5/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_6/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}], "userDefinedMetadata": {"signature": {"outputs": {"conv2d_9/Sigmoid": {"name": "conv2d_9/Sigmoid"}}}}}