{"generatedBy": "1.15.0", "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"dtype": "float32", "shape": [3, 128], "quantization": {"dtype": "uint8", "min": -0.2831568703931921, "scale": 0.002145127806009031}, "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.10406514336081112, "scale": 0.0008130089325063368}, "name": "dense_1/bias"}, {"dtype": "float32", "shape": [3, 3, 16, 16], "quantization": {"dtype": "uint8", "min": -0.42244908762913125, "scale": 0.003152605131560681}, "name": "conv2d_113/convolution/merged_input"}, {"dtype": "int32", "shape": [1], "name": "coordinate_channel2d_1/strided_slice/stack"}, {"dtype": "int32", "shape": [1], "name": "coordinate_channel2d_1/strided_slice/stack_1"}, {"dtype": "int32", "shape": [1], "name": "coordinate_channel2d_1/strided_slice_1/stack_1"}, {"dtype": "int32", "shape": [1], "name": "coordinate_channel2d_1/strided_slice_2/stack_1"}, {"dtype": "int32", "shape": [], "name": "coordinate_channel2d_1/ones/Const"}, {"dtype": "int32", "shape": [], "name": "coordinate_channel2d_1/ExpandDims/dim"}, {"dtype": "int32", "shape": [], "name": "coordinate_channel2d_1/arange/start"}, {"dtype": "int32", "shape": [4], "name": "coordinate_channel2d_1/transpose/perm"}, {"dtype": "float32", "shape": [], "quantization": {"dtype": "uint8", "min": 2.0, "scale": 1.0}, "name": "coordinate_channel2d_1/mul/y"}, {"dtype": "float32", "shape": [], "quantization": {"dtype": "uint8", "min": 1.0, "scale": 1.0}, "name": "coordinate_channel2d_1/sub_1/y"}, {"dtype": "int32", "shape": [], "name": "coordinate_channel2d_1/concat/axis"}, {"dtype": "float32", "shape": [16], "quantization": {"dtype": "uint8", "min": -0.8728318242465749, "scale": 0.005937631457459693}, "name": "batch_normalization_101/batchnorm/sub"}, {"dtype": "float32", "shape": [], "quantization": {"dtype": "uint8", "min": 0.30000001192092896, "scale": 1.0}, "name": "leaky_re_lu_106/LeakyRelu/alpha"}, {"dtype": "float32", "shape": [3], "quantization": {"dtype": "uint8", "min": 1.6074053049087524, "scale": 0.04860409521589092}, "name": "batch_normalization_1/batchnorm/mul"}, {"dtype": "float32", "shape": [3], "quantization": {"dtype": "uint8", "min": -0.19465398788452148, "scale": 0.00034103665281744563}, "name": "batch_normalization_1/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 16, 64], "quantization": {"dtype": "uint8", "min": -0.39031672547845275, "scale": 0.003025711050220564}, "name": "conv2d_114/kernel"}, {"dtype": "float32", "shape": [1, 1, 3, 8], "quantization": {"dtype": "uint8", "min": -1.0924954390993304, "scale": 0.008339659840452904}, "name": "conv2d_1/convolution/merged_input"}, {"dtype": "float32", "shape": [8], "quantization": {"dtype": "uint8", "min": -0.4606534354826983, "scale": 0.0033380683730630314}, "name": "batch_normalization_2/batchnorm/sub"}, {"dtype": "float32", "shape": [16], "quantization": {"dtype": "uint8", "min": -1.3795882786021514, "scale": 0.01130810064427993}, "name": "batch_normalization_118/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 8, 8], "quantization": {"dtype": "uint8", "min": -0.35279348983484154, "scale": 0.0030153289729473636}, "name": "conv2d_2/convolution/merged_input"}, {"dtype": "float32", "shape": [8], "quantization": {"dtype": "uint8", "min": -1.2606504776898553, "scale": 0.006565887904634663}, "name": "batch_normalization_3/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 8, 32], "quantization": {"dtype": "uint8", "min": -0.41388077081418506, "scale": 0.003233443521985821}, "name": "conv2d_3/kernel"}, {"dtype": "float32", "shape": [1, 1, 3, 32], "quantization": {"dtype": "uint8", "min": -0.4135365212664885, "scale": 0.003362085538751939}, "name": "conv2d_4/kernel"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": 1.3623281717300415, "scale": 0.009903025627136231}, "name": "batch_normalization_4/batchnorm/mul"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -0.47964270091524314, "scale": 0.005849301230673697}, "name": "batch_normalization_4/batchnorm/sub"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": 0.2174660563468933, "scale": 0.006078099035749248}, "name": "batch_normalization_102/batchnorm/mul"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -1.7845478759092444, "scale": 0.013218873154883291}, "name": "batch_normalization_102/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 32, 8], "quantization": {"dtype": "uint8", "min": -1.0474004913778865, "scale": 0.006890792706433464}, "name": "conv2d_5/convolution/merged_input"}, {"dtype": "float32", "shape": [8], "quantization": {"dtype": "uint8", "min": -0.4397014487023447, "scale": 0.003545979425018909}, "name": "batch_normalization_5/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 8, 8], "quantization": {"dtype": "uint8", "min": -0.3059469836599687, "scale": 0.002300353260601268}, "name": "conv2d_6/convolution/merged_input"}, {"dtype": "float32", "shape": [8], "quantization": {"dtype": "uint8", "min": -0.5000483974522235, "scale": 0.0034968419402253395}, "name": "batch_normalization_6/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 8, 32], "quantization": {"dtype": "uint8", "min": -0.3876496532384087, "scale": 0.0030765845495111803}, "name": "conv2d_7/kernel"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": 1.0297921895980835, "scale": 0.01287534797892851}, "name": "batch_normalization_7/batchnorm/mul"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -0.545008226703195, "scale": 0.006123687940485337}, "name": "batch_normalization_7/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 32, 16], "quantization": {"dtype": "uint8", "min": -0.5679186652688419, "scale": 0.004732655543907016}, "name": "conv2d_8/convolution/merged_input"}, {"dtype": "float32", "shape": [16], "quantization": {"dtype": "uint8", "min": -0.5444084726127923, "scale": 0.00539018289715636}, "name": "batch_normalization_8/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 16], "quantization": {"dtype": "uint8", "min": -0.39628709648169724, "scale": 0.0034459747520147587}, "name": "conv2d_115/convolution/merged_input"}, {"dtype": "float32", "shape": [3, 3, 16, 16], "quantization": {"dtype": "uint8", "min": -0.2161529078203089, "scale": 0.0017863876679364372}, "name": "conv2d_9/convolution/merged_input"}, {"dtype": "float32", "shape": [16], "quantization": {"dtype": "uint8", "min": -0.36159236851860493, "scale": 0.003888089984071021}, "name": "batch_normalization_9/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 16, 64], "quantization": {"dtype": "uint8", "min": -0.311127129723044, "scale": 0.002489017037784352}, "name": "conv2d_10/kernel"}, {"dtype": "float32", "shape": [1, 1, 32, 64], "quantization": {"dtype": "uint8", "min": -0.30724029868256814, "scale": 0.0022928380498699113}, "name": "conv2d_11/kernel"}, {"dtype": "float32", "shape": [16], "quantization": {"dtype": "uint8", "min": -0.42171087452009615, "scale": 0.003833735222909965}, "name": "batch_normalization_103/batchnorm/sub"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": 1.1686691045761108, "scale": 0.010936198047563142}, "name": "batch_normalization_10/batchnorm/mul"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -1.1744063508276845, "scale": 0.01334552671395096}, "name": "batch_normalization_10/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 16], "quantization": {"dtype": "uint8", "min": -0.3660361496841206, "scale": 0.0029759036559684603}, "name": "conv2d_12/convolution/merged_input"}, {"dtype": "float32", "shape": [16], "quantization": {"dtype": "uint8", "min": -0.34760952603583245, "scale": 0.0028033026293212294}, "name": "batch_normalization_11/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 16, 16], "quantization": {"dtype": "uint8", "min": -0.2031162358382169, "scale": 0.0015505056170856252}, "name": "conv2d_13/convolution/merged_input"}, {"dtype": "float32", "shape": [16], "quantization": {"dtype": "uint8", "min": -0.5434532225131988, "scale": 0.003551981846491496}, "name": "batch_normalization_12/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 16, 64], "quantization": {"dtype": "uint8", "min": -0.29903066999772016, "scale": 0.0024115376612719366}, "name": "conv2d_14/kernel"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": 0.9630791544914246, "scale": 0.008899893713932412}, "name": "batch_normalization_13/batchnorm/mul"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -1.3021989583969118, "scale": 0.009235453605651856}, "name": "batch_normalization_13/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 16, 16], "quantization": {"dtype": "uint8", "min": -0.45322692043641033, "scale": 0.003568715908948113}, "name": "conv2d_116/convolution/merged_input"}, {"dtype": "float32", "shape": [16], "quantization": {"dtype": "uint8", "min": -0.313086236224455, "scale": 0.005492740986393947}, "name": "batch_normalization_104/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 16], "quantization": {"dtype": "uint8", "min": -0.38804793498095347, "scale": 0.002962197976953843}, "name": "conv2d_15/convolution/merged_input"}, {"dtype": "float32", "shape": [16], "quantization": {"dtype": "uint8", "min": -0.362902885909174, "scale": 0.004593707416571823}, "name": "batch_normalization_14/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 16, 64], "quantization": {"dtype": "uint8", "min": -0.4001688924490237, "scale": 0.003449731831457101}, "name": "conv2d_117/kernel"}, {"dtype": "float32", "shape": [3, 3, 16, 16], "quantization": {"dtype": "uint8", "min": -0.21553071018527534, "scale": 0.0015505806488149306}, "name": "conv2d_16/convolution/merged_input"}, {"dtype": "float32", "shape": [16], "quantization": {"dtype": "uint8", "min": -0.7987109663439732, "scale": 0.005087330995821485}, "name": "batch_normalization_15/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 16, 64], "quantization": {"dtype": "uint8", "min": -0.32823389277738685, "scale": 0.002467924005845014}, "name": "conv2d_17/kernel"}, {"dtype": "float32", "shape": [1, 1, 64, 8], "quantization": {"dtype": "uint8", "min": -0.29140936159620096, "scale": 0.00227663563747032}, "name": "self_attention_5/kernel_f"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": 0.9238802790641785, "scale": 0.005598348963494394}, "name": "batch_normalization_16/batchnorm/mul"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -1.2643401412402882, "scale": 0.008428934274935254}, "name": "batch_normalization_16/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 8], "quantization": {"dtype": "uint8", "min": -0.28923630363800945, "scale": 0.0022955262193492814}, "name": "self_attention_5/kernel_g"}, {"dtype": "float32", "shape": [1, 1, 64, 64], "quantization": {"dtype": "uint8", "min": -0.2992440680662791, "scale": 0.0025146560341704127}, "name": "self_attention_5/kernel_h"}, {"dtype": "float32", "shape": [1, 1, 64, 32], "quantization": {"dtype": "uint8", "min": -0.3906023902051589, "scale": 0.00320165893610786}, "name": "conv2d_18/convolution/merged_input"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -0.3708216807421516, "scale": 0.004522215618806727}, "name": "batch_normalization_17/batchnorm/sub"}, {"dtype": "float32", "shape": [8], "quantization": {"dtype": "uint8", "min": -0.00015159668731868413, "scale": 1.6658976628426828e-06}, "name": "self_attention_5/bias_f"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "quantization": {"dtype": "uint8", "min": -0.166072890104032, "scale": 0.001169527395098817}, "name": "conv2d_19/convolution/merged_input"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -0.378994855226255, "scale": 0.002707106108758964}, "name": "batch_normalization_18/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 32, 128], "quantization": {"dtype": "uint8", "min": -0.23390920886806413, "scale": 0.0018418047942367255}, "name": "conv2d_20/kernel"}, {"dtype": "float32", "shape": [8], "quantization": {"dtype": "uint8", "min": -0.005702507320572348, "scale": 5.280099370900322e-05}, "name": "self_attention_5/bias_g"}, {"dtype": "float32", "shape": [1, 1, 64, 128], "quantization": {"dtype": "uint8", "min": -0.21212778126492218, "scale": 0.0016835538195628746}, "name": "conv2d_21/kernel"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.05118544033052874, "scale": 0.000368240577917473}, "name": "self_attention_5/bias_h"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": 0.6425133943557739, "scale": 0.009603617705550849}, "name": "batch_normalization_19/batchnorm/mul"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -1.1069329560971728, "scale": 0.011411679959764668}, "name": "batch_normalization_19/batchnorm/sub"}, {"dtype": "float32", "shape": [1], "quantization": {"dtype": "uint8", "min": 0.00738504808396101, "scale": 1.0}, "name": "self_attention_5/gamma"}, {"dtype": "float32", "shape": [1, 1, 16, 4], "quantization": {"dtype": "uint8", "min": -0.7781233668327332, "scale": 0.006538851822123808}, "name": "conv2d_133/convolution/merged_input"}, {"dtype": "float32", "shape": [1, 1, 128, 32], "quantization": {"dtype": "uint8", "min": -0.2573598332264844, "scale": 0.0019950374668719724}, "name": "conv2d_22/convolution/merged_input"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -0.48832729213378007, "scale": 0.0035644327892976647}, "name": "batch_normalization_20/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "quantization": {"dtype": "uint8", "min": -0.11130864640661314, "scale": 0.0008904691712529052}, "name": "conv2d_23/convolution/merged_input"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -0.3962469512341069, "scale": 0.0030956793065164603}, "name": "batch_normalization_21/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 32, 128], "quantization": {"dtype": "uint8", "min": -0.24632775549795113, "scale": 0.0019244355898277432}, "name": "conv2d_24/kernel"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": 0.5493819713592529, "scale": 0.008482605803246591}, "name": "batch_normalization_22/batchnorm/mul"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -1.2881561849631515, "scale": 0.013279960669723211}, "name": "batch_normalization_22/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 32], "quantization": {"dtype": "uint8", "min": -0.2509366647869933, "scale": 0.0020074933182959464}, "name": "conv2d_25/convolution/merged_input"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -0.43265820017047957, "scale": 0.002983849656348135}, "name": "batch_normalization_23/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "quantization": {"dtype": "uint8", "min": -0.1885673018062816, "scale": 0.0013469092986162971}, "name": "conv2d_26/convolution/merged_input"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -0.4294481472641814, "scale": 0.0033814814745211134}, "name": "batch_normalization_24/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 32, 128], "quantization": {"dtype": "uint8", "min": -0.2711528955721388, "scale": 0.0020235290714338714}, "name": "conv2d_27/kernel"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": 0.5854224562644958, "scale": 0.005756577557208492}, "name": "batch_normalization_25/batchnorm/mul"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -1.4350544705110437, "scale": 0.012588197109745998}, "name": "batch_normalization_25/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 64], "quantization": {"dtype": "uint8", "min": -0.3089837060255163, "scale": 0.0024918040808509377}, "name": "conv2d_28/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.5597600834042419, "scale": 0.0038339731740016565}, "name": "batch_normalization_26/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "quantization": {"dtype": "uint8", "min": -0.09316973090171814, "scale": 0.0007394423087437947}, "name": "conv2d_29/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.5800689341975194, "scale": 0.00432887264326507}, "name": "batch_normalization_27/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "quantization": {"dtype": "uint8", "min": -0.1876808826829873, "scale": 0.0015383678908441581}, "name": "conv2d_30/kernel"}, {"dtype": "float32", "shape": [1, 1, 128, 256], "quantization": {"dtype": "uint8", "min": -0.1642699004388323, "scale": 0.0013464745937609205}, "name": "conv2d_31/kernel"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": 0.7057126760482788, "scale": 0.005922605944614784}, "name": "batch_normalization_28/batchnorm/mul"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -2.321385439704446, "scale": 0.017856811074649585}, "name": "batch_normalization_28/batchnorm/sub"}, {"dtype": "float32", "shape": [4], "quantization": {"dtype": "uint8", "min": -0.4234776148609087, "scale": 0.004758175447875378}, "name": "batch_normalization_119/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "quantization": {"dtype": "uint8", "min": -0.1545502835629033, "scale": 0.0013439155092426374}, "name": "conv2d_32/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.647148936402564, "scale": 0.004044680852516025}, "name": "batch_normalization_29/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "quantization": {"dtype": "uint8", "min": -0.11171719297474506, "scale": 0.0008796629368090162}, "name": "conv2d_33/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.6375412160275029, "scale": 0.004366720657722623}, "name": "batch_normalization_30/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "quantization": {"dtype": "uint8", "min": -0.2072655112135644, "scale": 0.0016988976328980688}, "name": "conv2d_34/kernel"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": 0.2156497836112976, "scale": 0.003473161949830897}, "name": "batch_normalization_105/batchnorm/mul"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -1.956411829181746, "scale": 0.014074905245911842}, "name": "batch_normalization_105/batchnorm/sub"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": 0.5477610230445862, "scale": 0.004478747938193527}, "name": "batch_normalization_31/batchnorm/mul"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -1.7547913719626034, "scale": 0.014623261433021695}, "name": "batch_normalization_31/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "quantization": {"dtype": "uint8", "min": -0.16556088521200069, "scale": 0.001368271778611576}, "name": "conv2d_35/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.7292777278844048, "scale": 0.004215478195863612}, "name": "batch_normalization_32/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "quantization": {"dtype": "uint8", "min": -0.10744503993614048, "scale": 0.0008394143745010975}, "name": "conv2d_36/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.48982130394262424, "scale": 0.003575337984982659}, "name": "batch_normalization_33/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "quantization": {"dtype": "uint8", "min": -0.20201736495775335, "scale": 0.001590687913053176}, "name": "conv2d_37/kernel"}, {"dtype": "float32", "shape": [1], "quantization": {"dtype": "uint8", "min": 0.003527377499267459, "scale": 1.0}, "name": "conv2d_139/bias"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": 0.5995944738388062, "scale": 0.00409857946283677}, "name": "batch_normalization_34/batchnorm/mul"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -1.5183338146583707, "scale": 0.012445359136544022}, "name": "batch_normalization_34/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 8], "quantization": {"dtype": "uint8", "min": -0.31996594246696025, "scale": 0.0028067187935698268}, "name": "conv2d_118/convolution/merged_input"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "quantization": {"dtype": "uint8", "min": -0.19527334325453816, "scale": 0.0015255729941760793}, "name": "conv2d_38/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.6729683414393781, "scale": 0.004341731235092762}, "name": "batch_normalization_35/batchnorm/sub"}, {"dtype": "float32", "shape": [8], "quantization": {"dtype": "uint8", "min": -0.5280690511067708, "scale": 0.004125539461771647}, "name": "batch_normalization_106/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "quantization": {"dtype": "uint8", "min": -0.08271934331632128, "scale": 0.0007385655653242971}, "name": "conv2d_39/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.3504470095914953, "scale": 0.003809206625994514}, "name": "batch_normalization_36/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "quantization": {"dtype": "uint8", "min": -0.20304326824113433, "scale": 0.001586275533133862}, "name": "conv2d_40/kernel"}, {"dtype": "float32", "shape": [3, 3, 8, 32], "quantization": {"dtype": "uint8", "min": -0.24090695661657, "scale": 0.001974647185381721}, "name": "sub_pixel_conv2d_9/kernel"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "quantization": {"dtype": "uint8", "min": -0.1717565522474401, "scale": 0.0012914026484769933}, "name": "conv2d_41/kernel"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": 0.4319879710674286, "scale": 0.0036348030847661635}, "name": "batch_normalization_37/batchnorm/mul"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -2.961882507099825, "scale": 0.021939870422961666}, "name": "batch_normalization_37/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "quantization": {"dtype": "uint8", "min": -0.14911205575746647, "scale": 0.001274462015021081}, "name": "conv2d_42/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.5190683869754567, "scale": 0.005898504397448372}, "name": "batch_normalization_38/batchnorm/sub"}, {"dtype": "float32", "shape": [8], "quantization": {"dtype": "uint8", "min": 1.7853299379348755, "scale": 0.0033975877013860964}, "name": "batch_normalization_107/batchnorm/mul"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "quantization": {"dtype": "uint8", "min": -0.10467603352724338, "scale": 0.000887085029891893}, "name": "conv2d_43/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.6928671348328684, "scale": 0.005289062097960828}, "name": "batch_normalization_39/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "quantization": {"dtype": "uint8", "min": -0.20921316123476216, "scale": 0.001714861977334116}, "name": "conv2d_44/kernel"}, {"dtype": "float32", "shape": [8], "quantization": {"dtype": "uint8", "min": -0.40978246728579204, "scale": 0.004937138160069784}, "name": "batch_normalization_107/batchnorm/sub"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": 0.37380915880203247, "scale": 0.003308132349276075}, "name": "batch_normalization_40/batchnorm/mul"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -3.004409122467041, "scale": 0.01963666093115713}, "name": "batch_normalization_40/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 8, 32], "quantization": {"dtype": "uint8", "min": -0.6056582983802347, "scale": 0.004588320442274505}, "name": "conv2d_119/kernel"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "quantization": {"dtype": "uint8", "min": -0.17270889282226562, "scale": 0.0014513352338005514}, "name": "conv2d_45/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.6194732792237226, "scale": 0.004393427512224983}, "name": "batch_normalization_41/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 128], "quantization": {"dtype": "uint8", "min": -0.3032392420020758, "scale": 0.0022799943007674873}, "name": "sub_pixel_conv2d_10/kernel"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "quantization": {"dtype": "uint8", "min": -0.12225279387305764, "scale": 0.0010630677728091968}, "name": "conv2d_46/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.5429653485616048, "scale": 0.00399239226883533}, "name": "batch_normalization_42/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "quantization": {"dtype": "uint8", "min": -0.2200567565127915, "scale": 0.0016798225687999352}, "name": "conv2d_47/kernel"}, {"dtype": "int32", "shape": [2], "name": "global_average_pooling2d_5/Mean/reduction_indices"}, {"dtype": "float32", "shape": [32, 16], "quantization": {"dtype": "uint8", "min": -0.38192049428528435, "scale": 0.003080003986171648}, "name": "dense_20/kernel"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": 0.3906915485858917, "scale": 0.0029553042907340854}, "name": "batch_normalization_43/batchnorm/mul"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -2.856989720288445, "scale": 0.018314036668515672}, "name": "batch_normalization_43/batchnorm/sub"}, {"dtype": "float32", "shape": [16, 32], "quantization": {"dtype": "uint8", "min": -0.46597239176432287, "scale": 0.003426267586502374}, "name": "dense_21/kernel"}, {"dtype": "float32", "shape": [1, 1, 256, 128], "quantization": {"dtype": "uint8", "min": -0.18623146613438926, "scale": 0.0014663894971211752}, "name": "conv2d_48/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.7375934691990124, "scale": 0.005807822592118208}, "name": "batch_normalization_44/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "quantization": {"dtype": "uint8", "min": -0.053184816241264345, "scale": 0.00044693122891818776}, "name": "conv2d_49/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.5395348282421336, "scale": 0.004150267909554874}, "name": "batch_normalization_45/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "quantization": {"dtype": "uint8", "min": -0.17293873493577921, "scale": 0.0013201430147769405}, "name": "conv2d_50/kernel"}, {"dtype": "float32", "shape": [1, 1, 256, 512], "quantization": {"dtype": "uint8", "min": -0.13170633099827112, "scale": 0.001053650647986169}, "name": "conv2d_51/kernel"}, {"dtype": "float32", "shape": [1, 1, 32, 1], "quantization": {"dtype": "uint8", "min": -0.5647379999067269, "scale": 0.004446755904777377}, "name": "conv2d_120/kernel"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": 0.2464050054550171, "scale": 0.0045787844003415575}, "name": "batch_normalization_46/batchnorm/mul"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": -2.5498705546061196, "scale": 0.018749048195633233}, "name": "batch_normalization_46/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "quantization": {"dtype": "uint8", "min": -0.10022657978184084, "scale": 0.0008018126382547267}, "name": "conv2d_52/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.7622216350892012, "scale": 0.0053677579935859235}, "name": "batch_normalization_47/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "quantization": {"dtype": "uint8", "min": -0.05980390603928004, "scale": 0.0005111444960622226}, "name": "conv2d_53/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.7766467636706782, "scale": 0.004854042272941739}, "name": "batch_normalization_48/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "quantization": {"dtype": "uint8", "min": -0.17971619981176712, "scale": 0.0013117970789180082}, "name": "conv2d_54/kernel"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": 0.23264271020889282, "scale": 0.0038608011077432072}, "name": "batch_normalization_49/batchnorm/mul"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": -2.373528367397832, "scale": 0.016714988502801634}, "name": "batch_normalization_49/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "quantization": {"dtype": "uint8", "min": -0.10204851700394761, "scale": 0.0008163881360315809}, "name": "conv2d_55/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.5566976848770591, "scale": 0.005015294458351883}, "name": "batch_normalization_50/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "quantization": {"dtype": "uint8", "min": -0.056636540591716765, "scale": 0.0005102391044298808}, "name": "conv2d_56/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.4864948553197524, "scale": 0.0033784364952760583}, "name": "batch_normalization_51/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "quantization": {"dtype": "uint8", "min": -0.15769247915230544, "scale": 0.0012319724933773863}, "name": "conv2d_57/kernel"}, {"dtype": "float32", "shape": [1, 1, 514, 512], "quantization": {"dtype": "uint8", "min": -0.14605944016400504, "scale": 0.0011065109103333716}, "name": "conv2d_58/kernel"}, {"dtype": "float32", "shape": [3, 3, 512, 512], "quantization": {"dtype": "uint8", "min": -0.015753661928807988, "scale": 0.00011934592370309081}, "name": "conv2d_59/convolution/merged_input"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": -1.4432381171806186, "scale": 0.012230831501530665}, "name": "batch_normalization_52/batchnorm/mul_1"}, {"dtype": "float32", "shape": [128, 512], "quantization": {"dtype": "uint8", "min": -0.2225932997815749, "scale": 0.0017255294556711234}, "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": -0.0680294296320747, "scale": 0.0005193086231456084}, "name": "dense_2/bias"}, {"dtype": "float32", "shape": [128, 512], "quantization": {"dtype": "uint8", "min": -0.14957175295726924, "scale": 0.0011777303382462146}, "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": -0.10454814211994994, "scale": 0.0007802100158205219}, "name": "dense_3/bias"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": 0.2693241536617279, "scale": 0.006733526084937301}, "name": "batch_normalization_53/batchnorm/mul"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": -0.9969052959890926, "scale": 0.012307472789988798}, "name": "batch_normalization_53/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "quantization": {"dtype": "uint8", "min": -0.11365859426704107, "scale": 0.0008676228570003136}, "name": "conv2d_60/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.6153488079706827, "scale": 0.005170998386308258}, "name": "batch_normalization_54/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "quantization": {"dtype": "uint8", "min": -0.07813377783578986, "scale": 0.0006056882002774407}, "name": "conv2d_61/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.6866152524948119, "scale": 0.004401379823684692}, "name": "batch_normalization_55/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "quantization": {"dtype": "uint8", "min": -0.1521137931767632, "scale": 0.0012366975055021399}, "name": "conv2d_62/kernel"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": 0.25677332282066345, "scale": 0.004496804055045633}, "name": "batch_normalization_56/batchnorm/mul"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": -0.9691631808000452, "scale": 0.009143048875472124}, "name": "batch_normalization_56/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "quantization": {"dtype": "uint8", "min": -0.11606739110806409, "scale": 0.0009211697706989214}, "name": "conv2d_63/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.6226997831288507, "scale": 0.004612590986139634}, "name": "batch_normalization_57/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "quantization": {"dtype": "uint8", "min": -0.06759033740735522, "scale": 0.0005450833661883486}, "name": "conv2d_64/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.7436417130862966, "scale": 0.0047669340582454905}, "name": "batch_normalization_58/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "quantization": {"dtype": "uint8", "min": -0.1557508546932071, "scale": 0.0012766463499443205}, "name": "conv2d_65/kernel"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": 0.24275235831737518, "scale": 0.004276628879939809}, "name": "batch_normalization_59/batchnorm/mul"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": -0.982252268931445, "scale": 0.007985790804320691}, "name": "batch_normalization_59/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "quantization": {"dtype": "uint8", "min": -0.0958538458627813, "scale": 0.00083351170315462}, "name": "conv2d_66/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.5545852333891625, "scale": 0.004699874859230191}, "name": "batch_normalization_60/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 66, 32], "quantization": {"dtype": "uint8", "min": -0.42399295112665963, "scale": 0.003391943609013277}, "name": "conv2d_121/kernel"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "quantization": {"dtype": "uint8", "min": -0.05579274144827151, "scale": 0.00048097190903682337}, "name": "conv2d_67/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.5801517227116753, "scale": 0.004203997990664314}, "name": "batch_normalization_61/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "quantization": {"dtype": "uint8", "min": -0.14507329873010225, "scale": 0.00126150694547915}, "name": "conv2d_68/kernel"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": 0.24869443476200104, "scale": 0.003464857211299971}, "name": "batch_normalization_62/batchnorm/mul"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": -0.9879385092679192, "scale": 0.007599526994368609}, "name": "batch_normalization_62/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 4, 4], "quantization": {"dtype": "uint8", "min": -0.49560554448296046, "scale": 0.003996818907120649}, "name": "conv2d_134/convolution/merged_input"}, {"dtype": "float32", "shape": [1, 1, 512, 128], "quantization": {"dtype": "uint8", "min": -0.11038338991941189, "scale": 0.0010034853629037445}, "name": "conv2d_69/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.6464912681018605, "scale": 0.004973009754629696}, "name": "batch_normalization_63/batchnorm/sub"}, {"dtype": "float32", "shape": [4], "quantization": {"dtype": "uint8", "min": -0.1712022332584157, "scale": 0.00178335659644183}, "name": "batch_normalization_120/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 128, 128], "quantization": {"dtype": "uint8", "min": -0.05932764072044223, "scale": 0.0004903110803342333}, "name": "conv2d_70/convolution/merged_input"}, {"dtype": "float32", "shape": [128], "quantization": {"dtype": "uint8", "min": -0.7351510424239963, "scale": 0.004773708067688288}, "name": "batch_normalization_64/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 128, 512], "quantization": {"dtype": "uint8", "min": -0.15761241492103129, "scale": 0.001313436791008594}, "name": "conv2d_71/kernel"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "quantization": {"dtype": "uint8", "min": -0.1271833720744825, "scale": 0.0010014438746022243}, "name": "conv2d_122/convolution/merged_input"}, {"dtype": "float32", "shape": [1, 1, 512, 64], "quantization": {"dtype": "uint8", "min": -0.1368000651107115, "scale": 0.0010604656210132673}, "name": "self_attention_1/kernel_f"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -1.4805175402585198, "scale": 0.014954722628873937}, "name": "batch_normalization_108/batchnorm/mul_1"}, {"dtype": "float32", "shape": [1, 1, 512, 64], "quantization": {"dtype": "uint8", "min": -0.13226552629003338, "scale": 0.001058124210320267}, "name": "self_attention_1/kernel_g"}, {"dtype": "float32", "shape": [1, 1, 512, 512], "quantization": {"dtype": "uint8", "min": -0.15107105111374575, "scale": 0.0011710934194864011}, "name": "self_attention_1/kernel_h"}, {"dtype": "float32", "shape": [128, 32], "quantization": {"dtype": "uint8", "min": -0.2792639966104545, "scale": 0.0021481845893111884}, "name": "dense_22/kernel"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -1.0727528281088726e-05, "scale": 9.168827590674125e-08}, "name": "self_attention_1/bias_f"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.024031227564110476, "scale": 0.0001560469322344836}, "name": "self_attention_1/bias_g"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": -0.035177141449907245, "scale": 0.0002057142774848377}, "name": "self_attention_1/bias_h"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -0.2158916542343065, "scale": 0.0011927715703552845}, "name": "dense_22/bias"}, {"dtype": "float32", "shape": [1], "quantization": {"dtype": "uint8", "min": -0.0220259390771389, "scale": 1.0}, "name": "self_attention_1/gamma"}, {"dtype": "float32", "shape": [128, 32], "quantization": {"dtype": "uint8", "min": -0.2789166796441172, "scale": 0.0022493280616461063}, "name": "dense_23/kernel"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": 0.2542237639427185, "scale": 0.0033611384092592724}, "name": "batch_normalization_65/batchnorm/mul"}, {"dtype": "float32", "shape": [512], "quantization": {"dtype": "uint8", "min": -1.1371365509781184, "scale": 0.0074811615195928835}, "name": "batch_normalization_65/batchnorm/sub"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -0.13434118014924668, "scale": 0.000648991208450467}, "name": "dense_23/bias"}, {"dtype": "float32", "shape": [1, 1, 512, 64], "quantization": {"dtype": "uint8", "min": -0.09756198700736551, "scale": 0.0008130165583947126}, "name": "conv2d_72/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.5432673470646727, "scale": 0.0038258263877793855}, "name": "batch_normalization_66/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 64, 256], "quantization": {"dtype": "uint8", "min": -0.16336833261976055, "scale": 0.00142059419669357}, "name": "sub_pixel_conv2d_1/kernel"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": 0.4226692318916321, "scale": 0.0015082473848380294}, "name": "batch_normalization_67/batchnorm/mul"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.44531387160806096, "scale": 0.004498119915232939}, "name": "batch_normalization_67/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "quantization": {"dtype": "uint8", "min": -0.21292195390252505, "scale": 0.0016898567770041672}, "name": "conv2d_73/kernel"}, {"dtype": "float32", "shape": [1, 1, 512, 1024], "quantization": {"dtype": "uint8", "min": -0.1471137606045779, "scale": 0.0010897315600339103}, "name": "sub_pixel_conv2d_2/kernel"}, {"dtype": "float32", "shape": [256, 128], "quantization": {"dtype": "uint8", "min": -0.24167074876673078, "scale": 0.0019648028355018763}, "name": "dense_4/kernel"}, {"dtype": "float32", "shape": [128, 256], "quantization": {"dtype": "uint8", "min": -0.25755968573046667, "scale": 0.0017762736946928734}, "name": "dense_5/kernel"}, {"dtype": "float32", "shape": [1, 1, 256, 1], "quantization": {"dtype": "uint8", "min": -0.2104706396074856, "scale": 0.001492699571684295}, "name": "conv2d_74/kernel"}, {"dtype": "float32", "shape": [1, 1, 514, 256], "quantization": {"dtype": "uint8", "min": -0.21394861959943584, "scale": 0.0015966314895480287}, "name": "conv2d_75/kernel"}, {"dtype": "float32", "shape": [1, 1, 4, 16], "quantization": {"dtype": "uint8", "min": -0.5528063037816217, "scale": 0.005264821940777349}, "name": "conv2d_135/kernel"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "quantization": {"dtype": "uint8", "min": -0.03015630074283656, "scale": 0.00023745118695146897}, "name": "conv2d_76/convolution/merged_input"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -1.5453644009197458, "scale": 0.013437951312345616}, "name": "batch_normalization_68/batchnorm/mul_1"}, {"dtype": "float32", "shape": [128, 256], "quantization": {"dtype": "uint8", "min": -0.2884080420522129, "scale": 0.0022357212562187046}, "name": "dense_6/kernel"}, {"dtype": "float32", "shape": [3, 3, 4, 4], "quantization": {"dtype": "uint8", "min": -0.3544267952442169, "scale": 0.002549833059310913}, "name": "conv2d_137/convolution/merged_input"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -0.09870643300168654, "scale": 0.0008436447265101414}, "name": "dense_6/bias"}, {"dtype": "float32", "shape": [128, 256], "quantization": {"dtype": "uint8", "min": -0.20339335320042629, "scale": 0.0015292733323340323}, "name": "dense_7/kernel"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -0.15158813139971564, "scale": 0.001082772367140826}, "name": "dense_7/bias"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": 0.14316287636756897, "scale": 0.004257917754790362}, "name": "batch_normalization_69/batchnorm/mul"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -1.3164440678615197, "scale": 0.010284719280168123}, "name": "batch_normalization_69/batchnorm/sub"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": 0.15792733430862427, "scale": 0.0041292838021820665}, "name": "batch_normalization_109/batchnorm/mul"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -1.7629745146807503, "scale": 0.013355867535460229}, "name": "batch_normalization_109/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "quantization": {"dtype": "uint8", "min": -0.17196585711310894, "scale": 0.001457337772144991}, "name": "conv2d_77/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.7107979269588695, "scale": 0.005553108804366168}, "name": "batch_normalization_70/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "quantization": {"dtype": "uint8", "min": -0.1624365644127715, "scale": 0.0012399737741432939}, "name": "conv2d_78/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.8503614804323981, "scale": 0.005988461129805621}, "name": "batch_normalization_71/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "quantization": {"dtype": "uint8", "min": -0.21698510085835176, "scale": 0.001854573511609844}, "name": "conv2d_79/kernel"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": 0.14647002518177032, "scale": 0.0037588294230255425}, "name": "batch_normalization_72/batchnorm/mul"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -1.3901163793077655, "scale": 0.010374002830654967}, "name": "batch_normalization_72/batchnorm/sub"}, {"dtype": "float32", "shape": [4], "quantization": {"dtype": "uint8", "min": -0.46759194135665894, "scale": 0.0018118564459476986}, "name": "batch_normalization_123/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "quantization": {"dtype": "uint8", "min": -0.19597428125493668, "scale": 0.0014846536458707324}, "name": "conv2d_80/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.6694233540226431, "scale": 0.004318860348533181}, "name": "batch_normalization_73/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 32, 8], "quantization": {"dtype": "uint8", "min": -0.5570417198480344, "scale": 0.004284936306523342}, "name": "conv2d_123/convolution/merged_input"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "quantization": {"dtype": "uint8", "min": -0.14868573669125051, "scale": 0.0011894858935300042}, "name": "conv2d_81/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -1.1516801034702975, "scale": 0.007109136441174675}, "name": "batch_normalization_74/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "quantization": {"dtype": "uint8", "min": -0.21075338423252105, "scale": 0.0017710368422900928}, "name": "conv2d_82/kernel"}, {"dtype": "float32", "shape": [8], "quantization": {"dtype": "uint8", "min": -0.6886052802497264, "scale": 0.004277051430122525}, "name": "batch_normalization_110/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 32], "quantization": {"dtype": "uint8", "min": -0.15456445743055905, "scale": 0.001198174088608985}, "name": "self_attention_2/kernel_f"}, {"dtype": "float32", "shape": [1, 1, 256, 32], "quantization": {"dtype": "uint8", "min": -0.1542783176197725, "scale": 0.0012052993564044727}, "name": "self_attention_2/kernel_g"}, {"dtype": "float32", "shape": [1, 1, 256, 256], "quantization": {"dtype": "uint8", "min": -0.2939533560883765, "scale": 0.0019087880265478995}, "name": "self_attention_2/kernel_h"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -0.00014482469648332793, "scale": 1.2816344821533444e-06}, "name": "self_attention_2/bias_f"}, {"dtype": "float32", "shape": [32], "quantization": {"dtype": "uint8", "min": -0.006694408944424461, "scale": 8.473935372689191e-05}, "name": "self_attention_2/bias_g"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -0.03713869467085483, "scale": 0.00036770984822628546}, "name": "self_attention_2/bias_h"}, {"dtype": "float32", "shape": [1], "quantization": {"dtype": "uint8", "min": 0.09889182448387146, "scale": 1.0}, "name": "self_attention_2/gamma"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": 0.13916456699371338, "scale": 0.0034999436023188573}, "name": "batch_normalization_75/batchnorm/mul"}, {"dtype": "float32", "shape": [256], "quantization": {"dtype": "uint8", "min": -1.3411423383974561, "scale": 0.010008524913413851}, "name": "batch_normalization_75/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 64], "quantization": {"dtype": "uint8", "min": -0.16980253948884852, "scale": 0.001415021162407071}, "name": "conv2d_84/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.8245240926742553, "scale": 0.006018424034118652}, "name": "batch_normalization_76/batchnorm/sub"}, {"dtype": "float32", "shape": [3, 3, 64, 256], "quantization": {"dtype": "uint8", "min": -0.16389129535824645, "scale": 0.0014128559944676419}, "name": "sub_pixel_conv2d_3/kernel"}, {"dtype": "float32", "shape": [3, 3, 8, 8], "quantization": {"dtype": "uint8", "min": -0.4516994973023733, "scale": 0.0032970766226450604}, "name": "conv2d_124/convolution/merged_input"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": 0.4097460210323334, "scale": 0.0017823685618007885}, "name": "batch_normalization_77/batchnorm/mul"}, {"dtype": "float32", "shape": [64], "quantization": {"dtype": "uint8", "min": -0.6695341907295526, "scale": 0.004682057277829039}, "name": "batch_normalization_77/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 64, 256], "quantization": {"dtype": "uint8", "min": -0.20122874016855277, "scale": 0.0016228124207141354}, "name": "conv2d_85/kernel"}, {"dtype": "float32", "shape": [8], "quantization": {"dtype": "uint8", "min": -0.79834758347156, "scale": 0.005252286733365526}, "name": "batch_normalization_111/batchnorm/sub"}, {"dtype": "float32", "shape": [1, 1, 256, 1024], "quantization": {"dtype": "uint8", "min": -0.1546629334197325, "scale": 0.0011542009956696454}, "name": "sub_pixel_conv2d_4/kernel"}, {"dtype": "float32", "shape": [256, 128], "quantization": {"dtype": "uint8", "min": -0.3070266323931077, "scale": 0.002224830669515273}, "name": "dense_8/kernel"}, {"dtype": "float32", "shape": [128, 256], "quantization": {"dtype": "uint8", "min": -0.24302665112065333, "scale": 0.0019598923477472043}, "name": "dense_9/kernel"}, {"dtype": "float32",